package Convertor;
/*Задание на форматирование строк вывода
        1. Создать класс конвертор валют.
        2. Создать мини-Приложение интернет-магазин. В приложении
        рассчитывается стоимость покупки товара, где пользователь может выбрать
        валюту для оплаты товара
        3. Разработать класс Отчет о сотрудниках
        1) Создать класс Employee, у которого есть переменные класса -
        fullname, salary.
        2) Создать массив, содержащий несколько объектов этого типа.
        3) Создать класс Report со статическим методом generateReport,
        в котором выводится информация о зарплате всех сотрудников.
        4) Используйте форматирование строк. Пусть salary будет
        выровнено по правому краю, десятичное значение имеет 2 знака после
        запятой и можете добавить что-нибудь свое.  */
public class Convertor {
}
